InformationRegisters/СведенияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбЭЛН</Name>
			<Comment>Сведения об электронных листках нетрудоспособности</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Comment>Заполняется при получении ЭЛН, при отправке реестров и при обновлении Хэша ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененияПринятыФСС</Name>
					<Comment>Актуализируется при проведении больничных, включается при отправке реестров.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодготовленныйКОтправкеРеестр</Name>
					<Comment>Заполняется при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятыйРеестр</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеОтправки</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭЛНВРеестрахЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеФСС</Name>
					<Comment>АПК:58 Обратная совместимость.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭЛНВФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступенИсходныйXML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПричиныИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПричиныИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервичногоЛН</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаменяемогоЛН</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящийЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветНаЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОСтраховомСлучае</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеОСтраховомСлучаеФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРеестрЭЛН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Больничный</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБольничного</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНетрудоспособности</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНетрудоспособностиНачало</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНетрудоспособностиОкончание</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленныйРеестр</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКСостоянию</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БольничныйПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерЛисткаНетрудоспособности</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОбЭЛН/Forms/ПериодыЛеченияРодственниковЭЛН/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстXML = РегистрыСведений.СведенияОбЭЛН.ИсходныйXML(Параметры.НомерЛисткаНетрудоспособности, Параметры.ГоловнаяОрганизация);
	Если Не ЗначениеЗаполнено(ТекстXML) Тогда
		Текст = НСтр("ru = 'Не удалось получить данные ЭЛН %1'");
		ВызватьИсключение Текст;
	КонецЕсли;
	ДанныеЭЛН = ЭЛНФСС.ДанныеЭЛНИзXML(ТекстXML);
	Если Не ДанныеЭЛН.Успех Тогда
		ВызватьИсключение ДанныеЭЛН.ТекстОшибки;
	КонецЕсли;
	ПериодыЛечения = ДанныеЭЛН.ПериодыЛеченияРодственников;
	ПериодыЛечения.Колонки.Вставить(ПериодыЛечения.Колонки.Индекс(ПериодыЛечения.Колонки.ВозрастЛет), "Возраст");
	Для Каждого СтрокаТаблицы Из ПериодыЛечения Цикл
		СтрокаТаблицы.КодСвязи = ПрямыеВыплатыПособийСоциальногоСтрахованияФормы.ПредставлениеРодственнойСвязи(СтрокаТаблицы.КодСвязи);
		СтрокаТаблицы.ТипЛечения = СтрокаТаблицы.ТипЛечения + " - " + СтрокаТаблицы.РежимЛечения;
		СтрокаТаблицы.Возраст = ЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(СтрокаТаблицы.ВозрастЛет, СтрокаТаблицы.ВозрастМесяцев);
	КонецЦикла;
	ПериодыЛечения.Колонки.Удалить("Фамилия");
	ПериодыЛечения.Колонки.Удалить("Имя");
	ПериодыЛечения.Колонки.Удалить("Отчество");
	ПериодыЛечения.Колонки.Удалить("РежимЛечения");
	ПериодыЛечения.Колонки.Удалить("ВозрастЛет");
	ПериодыЛечения.Колонки.Удалить("ВозрастМесяцев");
	
	ТабличныйДокумент1 = Новый ТабличныйДокумент;
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ПериодыЛечения);
	ПостроительОтчета.ЗаполнитьНастройки();
	ПостроительОтчета.ВыводитьЗаголовокОтчета = Ложь;
	ПостроительОтчета.ВыводитьПодвалОтчета = Ложь;
	ПостроительОтчета.ВыводитьПодвалТаблицы = Ложь;
	ПостроительОтчета.ВыводитьОбщиеИтоги = Ложь;
	
	// Получение автоматически сгенерированного макета
	ПостроительОтчета.Макет = Неопределено;
	Макет = ПостроительОтчета.Макет;
	ИскатьПоСтрокам = Истина;
	ЯчейкаЦеликом   = Истина;
	
	ОбластьПараметров = Макет.Области.Детали;
	Область = Макет.НайтиТекст("ДатаРождения", , ОбластьПараметров, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Формат = "ДЛФ=D";
	Область = Макет.НайтиТекст("ДатаНачала", , ОбластьПараметров, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Формат = "ДЛФ=D";
	Область = Макет.НайтиТекст("ДатаОкончания", , ОбластьПараметров, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Формат = "ДЛФ=D";
	
	ОбластьЗаголовков = Макет.Области.ШапкаТаблицы;
	Область = Макет.НайтиТекст("ФИО", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.ШиринаКолонки = 30;
	Область = Макет.НайтиТекст("КодСвязи", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'Код связи'");
	Область.ШиринаКолонки = 13;
	Область = Макет.НайтиТекст("ДатаРождения", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'Дата рождения'");
	Область.ШиринаКолонки = 13;
	Область = Макет.НайтиТекст("Возраст", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'Возраст'");
	Область.ШиринаКолонки = 15;
	Область = Макет.НайтиТекст("СНИЛС", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.ШиринаКолонки = 12;
	Область = Макет.НайтиТекст("КодПричины", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'Код причины'");
	Область.ШиринаКолонки = 12;
	Область = Макет.НайтиТекст("ТипЛечения", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'Тип лечения'");
	Область.ШиринаКолонки = 18;
	Область = Макет.НайтиТекст("ДатаНачала", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'С'");
	Область.ШиринаКолонки = 9;
	Область = Макет.НайтиТекст("ДатаОкончания", , ОбластьЗаголовков, ИскатьПоСтрокам, ЯчейкаЦеликом);
	Область.Текст = НСтр("ru = 'По'");
	Область.ШиринаКолонки = 9;
	
	ПостроительОтчета.Макет = Макет;
	ПостроительОтчета.Вывести(ТабличныйДокумент1);
	
	// Второй табличный документ нужен для того, чтобы:
	// - избавиться от пустой первой строки,
	// - восстановить форматирование ширины колонок.
	ТабличныйДокумент.Вывести(ТабличныйДокумент1.ПолучитьОбласть(1, 2, ТабличныйДокумент1.ВысотаТаблицы, ТабличныйДокумент1.ШиринаТаблицы));
	ТабличныйДокумент.Область().СоздатьФорматСтрок();
	
	ЗаголовокДокумента = НСтр("ru = 'Периоды лечения родственников в ЭЛН %1'");
	ЗаголовокДокумента = СтрШаблон(ЗаголовокДокумента, Параметры.НомерЛисткаНетрудоспособности);
	Заголовок = ЗаголовокДокумента;
КонецПроцедуры

#КонецОбласти
